# Homebrew packages
brew "coreutils"
brew "just"
brew "mas"
brew "nodenv"
brew "postgresql@15"
brew "pyenv"
brew "redis"
# brew "whalebrew"

# Whalebrew packages
# whalebrew "whalebrew/wget"

# Homebrew Cask apps
# cask "docker"
# cask "firefox"
# cask "google-chrome"
# cask "visual-studio-code"

# Mac App Store apps
# mas "1Password", id: 443987910

# VS Code extensions (required ones, not merely recommended)
vscode "EditorConfig.EditorConfig"
vscode "dbaeumer.vscode-eslint"
vscode "foxundermoon.shell-format"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "skellock.just"
vscode "timonwong.shellcheck"
